### Imports

In [1]:
import pandas as pd
import numpy as np

temperatures = pd.read_csv("temperatures.csv")
print(temperatures)

       Unnamed: 0        date     city        country  avg_temp_c
0               0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1               1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2               2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3               3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4               4  2000-05-01  Abidjan  Côte D'Ivoire      27.547
...           ...         ...      ...            ...         ...
16495       16495  2013-05-01     Xian          China      18.979
16496       16496  2013-06-01     Xian          China      23.522
16497       16497  2013-07-01     Xian          China      25.251
16498       16498  2013-08-01     Xian          China      24.528
16499       16499  2013-09-01     Xian          China         NaN

[16500 rows x 5 columns]

## Subset by single level index

In [3]:
# Set the index of temperatures to city
temperatures_ind = temperatures.set_index("city")
print(temperatures_ind)

         Unnamed: 0        date        country  avg_temp_c
city
Abidjan           0  2000-01-01  Côte D'Ivoire      27.293
Abidjan           1  2000-02-01  Côte D'Ivoire      27.685
Abidjan           2  2000-03-01  Côte D'Ivoire      29.061
Abidjan           3  2000-04-01  Côte D'Ivoire      28.162
Abidjan           4  2000-05-01  Côte D'Ivoire      27.547
...             ...         ...            ...         ...
Xian          16495  2013-05-01          China      18.979
Xian          16496  2013-06-01          China      23.522
Xian          16497  2013-07-01          China      25.251
Xian          16498  2013-08-01          China      24.528
Xian          16499  2013-09-01          China         NaN

[16500 rows x 4 columns]

In [5]:
# Sort the index of temperatures_ind
temperatures_srt = temperatures_ind.sort_index()
print(temperatures_srt.head())

         Unnamed: 0        date        country  avg_temp_c
city
Abidjan           0  2000-01-01  Côte D'Ivoire      27.293
Abidjan         106  2008-11-01  Côte D'Ivoire      27.302
Abidjan         107  2008-12-01  Côte D'Ivoire      27.472
Abidjan         108  2009-01-01  Côte D'Ivoire      26.912
Abidjan         109  2009-02-01  Côte D'Ivoire      28.224

In [22]:
# Subset rows from Pakistan to Russia
print(temperatures_srt.loc["Pakistan" : "Russia"])

       Unnamed: 0        date country  avg_temp_c
city
Paris       11991  2009-04-01  France      12.098
Paris       11990  2009-03-01  France       7.197
Paris       11986  2008-11-01  France       7.512
Paris       11988  2009-01-01  France       0.981
Paris       11987  2008-12-01  France       2.891
...           ...         ...     ...         ...
Rome        12925  2004-08-01   Italy      22.825
Rome        12926  2004-09-01   Italy      18.680
Rome        12927  2004-10-01   Italy      15.510
Rome        12928  2004-11-01   Italy       8.556
Rome        12921  2004-04-01   Italy      10.407

[1155 rows x 4 columns]

In [14]:
# Try to subset rows from Lahore to Moscow
temperatures_srt.loc["Lahore" : "Moscow"]

        Unnamed: 0        date   country  avg_temp_c
city
Lahore        8526  2009-04-01  Pakistan      27.062
Lahore        8520  2008-10-01  Pakistan      27.257
Lahore        8521  2008-11-01  Pakistan      20.205
Lahore        8522  2008-12-01  Pakistan      15.522
Lahore        8523  2009-01-01  Pakistan      14.174
...            ...         ...       ...         ...
Moscow       10780  2004-08-01    Russia      17.955
Moscow       10783  2004-11-01    Russia      -2.191
Moscow       10778  2004-06-01    Russia      14.791
Moscow       10777  2004-05-01    Russia      10.914
Moscow       10779  2004-07-01    Russia      18.381

[2475 rows x 4 columns]

## Subset by hierarchical index

In [20]:
# Subset rows from Pakistan, Lahore to Russia, Moscow
temperatures_ind2 = temperatures.set_index(["country", "city"]).sort_index()
print(temperatures_ind2)

                    Unnamed: 0        date  avg_temp_c
country     city
Afghanistan Kabul         7260  2000-01-01       3.326
            Kabul         7261  2000-02-01       3.454
            Kabul         7262  2000-03-01       9.612
            Kabul         7263  2000-04-01      17.925
            Kabul         7264  2000-05-01      24.658
...                        ...         ...         ...
Zimbabwe    Harare        5605  2013-05-01      18.298
            Harare        5606  2013-06-01      17.020
            Harare        5607  2013-07-01      16.299
            Harare        5608  2013-08-01      19.232
            Harare        5609  2013-09-01         NaN

[16500 rows x 3 columns]

In [21]:
temperatures_ind2.loc[("Pakistan", "Lahore"):("Russia", "Moscow")]

                 Unnamed: 0        date  avg_temp_c
country  city
Pakistan Lahore        8415  2000-01-01      12.792
         Lahore        8416  2000-02-01      14.339
         Lahore        8417  2000-03-01      20.309
         Lahore        8418  2000-04-01      29.072
         Lahore        8419  2000-05-01      34.845
...                     ...         ...         ...
Russia   Moscow       10885  2013-05-01      16.152
         Moscow       10886  2013-06-01      18.718
         Moscow       10887  2013-07-01      18.136
         Moscow       10888  2013-08-01      17.485
         Moscow       10889  2013-09-01         NaN

[660 rows x 3 columns]

In [23]:
temperatures_ind.loc[["Lahore", "Moscow"]]

        Unnamed: 0        date   country  avg_temp_c
city
Lahore        8415  2000-01-01  Pakistan      12.792
Lahore        8416  2000-02-01  Pakistan      14.339
Lahore        8417  2000-03-01  Pakistan      20.309
Lahore        8418  2000-04-01  Pakistan      29.072
Lahore        8419  2000-05-01  Pakistan      34.845
...            ...         ...       ...         ...
Moscow       10885  2013-05-01    Russia      16.152
Moscow       10886  2013-06-01    Russia      18.718
Moscow       10887  2013-07-01    Russia      18.136
Moscow       10888  2013-08-01    Russia      17.485
Moscow       10889  2013-09-01    Russia         NaN

[330 rows x 4 columns]

In [28]:
# Subset rows from Pakistan, Lahore to Russia, Moscow
temperatures_ind["country_srt"] = temperatures_ind["country"].isin(["Russia", "Pakistan"])
temperatures_ind
print(temperatures_ind.loc[("Lahore"):("Moscow")])

        Unnamed: 0        date   country  avg_temp_c  country_srt
city
Lahore        8415  2000-01-01  Pakistan      12.792         True
Lahore        8416  2000-02-01  Pakistan      14.339         True
Lahore        8417  2000-03-01  Pakistan      20.309         True
Lahore        8418  2000-04-01  Pakistan      29.072         True
Lahore        8419  2000-05-01  Pakistan      34.845         True
...            ...         ...       ...         ...          ...
Moscow       10885  2013-05-01    Russia      16.152         True
Moscow       10886  2013-06-01    Russia      18.718         True
Moscow       10887  2013-07-01    Russia      18.136         True
Moscow       10888  2013-08-01    Russia      17.485         True
Moscow       10889  2013-09-01    Russia         NaN         True

[2475 rows x 5 columns]

In [29]:
temperatures_srt["country_srt"] = temperatures_srt["country"].isin(["Russia", "Pakistan"])
temperatures_srt
print(temperatures_srt.loc[("Lahore"):("Moscow")])

        Unnamed: 0        date   country  avg_temp_c  country_srt
city
Lahore        8526  2009-04-01  Pakistan      27.062         True
Lahore        8520  2008-10-01  Pakistan      27.257         True
Lahore        8521  2008-11-01  Pakistan      20.205         True
Lahore        8522  2008-12-01  Pakistan      15.522         True
Lahore        8523  2009-01-01  Pakistan      14.174         True
...            ...         ...       ...         ...          ...
Moscow       10780  2004-08-01    Russia      17.955         True
Moscow       10783  2004-11-01    Russia      -2.191         True
Moscow       10778  2004-06-01    Russia      14.791         True
Moscow       10777  2004-05-01    Russia      10.914         True
Moscow       10779  2004-07-01    Russia      18.381         True

[2475 rows x 5 columns]

### Subsetting columns

In [34]:
temperatures_ind2 = temperatures.set_index(["country", "city"]).sort_index()

# Subset rows from India, Hyderabad to Iraq, Baghdad
print(temperatures_ind2.loc[("India", "Hyderabad"):("Iraq", "Baghdad")])

# Subset columns from date to avg_temp_c
print(temperatures_ind2.loc[:, "date": "avg_temp_c"])

# Subset in both directions at once
print(temperatures_ind2.loc[("India", "Hyderabad"):("Iraq", "Baghdad"), "date": "avg_temp_c"])

                   Unnamed: 0        date  avg_temp_c
country city
India   Hyderabad        5940  2000-01-01      23.779
        Hyderabad        5941  2000-02-01      25.826
        Hyderabad        5942  2000-03-01      28.821
        Hyderabad        5943  2000-04-01      32.698
        Hyderabad        5944  2000-05-01      32.438
...                       ...         ...         ...
Iraq    Baghdad          1150  2013-05-01      28.673
        Baghdad          1151  2013-06-01      33.803
        Baghdad          1152  2013-07-01      36.392
        Baghdad          1153  2013-08-01      35.463
        Baghdad          1154  2013-09-01         NaN

[2145 rows x 3 columns]
                          date  avg_temp_c
country     city
Afghanistan Kabul   2000-01-01       3.326
            Kabul   2000-02-01       3.454
            Kabul   2000-03-01       9.612
            Kabul   2000-04-01      17.925
            Kabul   2000-05-01      24.658
...                        ...         ...
Zimbabwe    Harare  2013-05-01      18.298
            Harare  2013-06-01      17.020
            Harare  2013-07-01      16.299
            Harare  2013-08-01      19.232
            Harare  2013-09-01         NaN

[16500 rows x 2 columns]
                         date  avg_temp_c
country city
India   Hyderabad  2000-01-01      23.779
        Hyderabad  2000-02-01      25.826
        Hyderabad  2000-03-01      28.821
        Hyderabad  2000-04-01      32.698
        Hyderabad  2000-05-01      32.438
...                       ...         ...
Iraq    Baghdad    2013-05-01      28.673
        Baghdad    2013-06-01      33.803
        Baghdad    2013-07-01      36.392
        Baghdad    2013-08-01      35.463
        Baghdad    2013-09-01         NaN

[2145 rows x 2 columns]

## Slicing time series

In [39]:
# Use Boolean conditions to subset temperatures for rows in 2010 and 2011
temperatures_bool = temperatures[(temperatures["date"] >= "2010-01-01") & (temperatures["date"] <= "2011-12-31")]
print(temperatures_bool)

# Set date as the index and sort the index
temperatures_ind = temperatures.set_index("date").sort_index()

# Use .loc[] to subset temperatures_ind for rows in 2010 and 2011
print(temperatures_ind.loc["2010" : "2011"])

# Use .loc[] to subset temperatures_ind for rows from Aug 2010 to Feb 2011
print(temperatures_ind.loc["2010-08-01" : "2011-02-28"])

       Unnamed: 0        date     city        country  avg_temp_c
120           120  2010-01-01  Abidjan  Côte D'Ivoire      28.270
121           121  2010-02-01  Abidjan  Côte D'Ivoire      29.262
122           122  2010-03-01  Abidjan  Côte D'Ivoire      29.596
123           123  2010-04-01  Abidjan  Côte D'Ivoire      29.068
124           124  2010-05-01  Abidjan  Côte D'Ivoire      28.258
...           ...         ...      ...            ...         ...
16474       16474  2011-08-01     Xian          China      23.069
16475       16475  2011-09-01     Xian          China      16.775
16476       16476  2011-10-01     Xian          China      12.587
16477       16477  2011-11-01     Xian          China       7.543
16478       16478  2011-12-01     Xian          China      -0.490

[2400 rows x 5 columns]
            Unnamed: 0        city    country  avg_temp_c
date
2010-01-01        4905  Faisalabad   Pakistan      11.810
2010-01-01       10185   Melbourne  Australia      20.016
2010-01-01        3750   Chongqing      China       7.921
2010-01-01       13155   São Paulo     Brazil      23.738
2010-01-01        5400   Guangzhou      China      14.136
...                ...         ...        ...         ...
2010-12-01        6896     Jakarta  Indonesia      26.602
2010-12-01        5246       Gizeh      Egypt      16.530
2010-12-01       11186      Nagpur      India      19.120
2010-12-01       14981      Sydney  Australia      19.559
2010-12-01       13496    Salvador     Brazil      26.265

[1200 rows x 4 columns]
            Unnamed: 0      city        country  avg_temp_c
date
2010-08-01        2602  Calcutta          India      30.226
2010-08-01       12337      Pune          India      24.941
2010-08-01        6562     Izmir         Turkey      28.352
2010-08-01       15637   Tianjin          China      25.543
2010-08-01        9862    Manila    Philippines      27.101
...                ...       ...            ...         ...
2011-02-01        7393     Kabul    Afghanistan       3.914
2011-02-01        3598   Chicago  United States       0.276
2011-02-01         628    Aleppo          Syria       8.246
2011-02-01        4423     Delhi          India      18.136
2011-02-01       12508   Rangoon          Burma      26.631

[700 rows x 4 columns]

## Subsetting by row/column number

In [44]:
# Get 23rd row, 2nd column (index 22, 1)
print(temperatures.iloc[[22, 1]])

    Unnamed: 0        date     city        country  avg_temp_c
22          22  2001-11-01  Abidjan  Côte D'Ivoire      27.374
1            1  2000-02-01  Abidjan  Côte D'Ivoire      27.685

In [47]:
# Use slicing to get the first 5 rows
print(temperatures.iloc[:5, :])

   Unnamed: 0        date     city        country  avg_temp_c
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [48]:
# Use slicing to get columns 3 to 4
print(temperatures.iloc[:, 2:4])

          city        country
0      Abidjan  Côte D'Ivoire
1      Abidjan  Côte D'Ivoire
2      Abidjan  Côte D'Ivoire
3      Abidjan  Côte D'Ivoire
4      Abidjan  Côte D'Ivoire
...        ...            ...
16495     Xian          China
16496     Xian          China
16497     Xian          China
16498     Xian          China
16499     Xian          China

[16500 rows x 2 columns]

In [49]:
# Use slicing in both directions at once
print(temperatures.iloc[:5, 2:4])

      city        country
0  Abidjan  Côte D'Ivoire
1  Abidjan  Côte D'Ivoire
2  Abidjan  Côte D'Ivoire
3  Abidjan  Côte D'Ivoire
4  Abidjan  Côte D'Ivoire